In [2]:
import pandas as pd

In [10]:
dataset = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex1.csv")
dataset.head()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
dataset1 = pd.read_table("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/test.tsv")
dataset1.head()

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

## Trying to read TSV data using read_csv

In [22]:
#dataset2 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/test.tsv")
# when i use the above line it reads the file as if it is a CSV hence we are not getting the data in good format
dataset2 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/test.tsv",sep='\t')
#In the above line you can see that i have overidden the default delimeter saying sep = '\t'
dataset2

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

## I don't want my first row to be the header then use header = none

In [24]:
dataset3 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex2.csv",header = None)
dataset3

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

## To give your own column names for the datatset

In [26]:
dataset4 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex2.csv",names = ["one","two","three","four","five","six"])
dataset4

   one  two  three  four   five  six
0    1    2      3     4  hello  NaN
1    5    6      7     8  world  NaN
2    9   10     11    12    foo  NaN

## index_col just to make multilabel indexing

In [28]:
dataset5 = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/csv_mindex.csv")
dataset5

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [31]:
multilabelindex = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/csv_mindex.csv",
                             index_col=['key1','key2'])
multilabelindex
## as you can see the below and above output the below one looks more clear and it is also easy to read

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

## Skip some of the rows because it doesn't make any sense about the data and looks bad

In [34]:
NotskippedRows = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex4.csv")
NotskippedRows

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [37]:
skippedRows = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex4.csv",skiprows=[0,2,3])
skippedRows
# we can see the above and below data and there is a lot of difference between both of them.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## This is to find where the null values are located in the dataset

In [38]:
normalData = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex5.csv")
normalData

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [40]:
df = pd.read_csv("/Users/siddartha/Desktop/github/Data-Science/Data Analysis/examples/ex5.csv")
pd.isnull(df)
## so in the below output we can see where there are null values in the dataset there the value will be true and 
# where the values are not null there it is false.

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False